src/test/resources/traffic_speed_sample.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Body>
		<d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			modelBaseVersion="2">
			<exchange>
				<supplierIdentification>
					<country>nl</country>
					<nationalIdentifier>NLNDW</nationalIdentifier>
				</supplierIdentification>
			</exchange>
			<payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="MeasuredDataPublication" lang="nl">
				<publicationTime>2016-09-09T13:58:40.009Z</publicationTime>
				<publicationCreator>
					<country>nl</country>
					<nationalIdentifier>NLNDW</nationalIdentifier>
				</publicationCreator>
				<measurementSiteTableReference id="NDW01_MT"
					version="868" targetClass="MeasurementSiteTable" />
				<headerInformation>
					<confidentiality>noRestriction</confidentiality>
					<informationStatus>real</informationStatus>
				</headerInformation>
				<siteMeasurements xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
					<measurementSiteReference id="PUT01_PUVIS_N416.03_1_2"
						version="12" targetClass="MeasurementSiteRecord" />
					<measurementTimeDefault>2016-09-09T13:57:00Z
					</measurementTimeDefault>
					<measuredValue index="1">
						<measuredValue>
							<basicData xsi:type="TrafficFlow">
								<vehicleFlow>
									<vehicleFlowRate>540</vehicleFlowRate>
								</vehicleFlow>
							</basicData>
						</measuredValue>
					</measuredValue>
					<measuredValue index="2">
						<measuredValue>
							<basicData xsi:type="TrafficSpeed">
								<averageVehicleSpeed
									numberOfInputValuesUsed="0">
									<speed>80</speed>
								</averageVehicleSpeed>
							</basicData>
						</measuredValue>
					</measuredValue>					
				</siteMeasurements>
				<siteMeasurements xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
					<measurementSiteReference id="PUT01_N237.15_0"
						version="1" targetClass="MeasurementSiteRecord" />
					<measurementTimeDefault>2016-09-09T13:57:00Z
					</measurementTimeDefault>
					<measuredValue index="1">
						<measuredValue>
							<basicData xsi:type="TrafficFlow">
								<vehicleFlow>
									<vehicleFlowRate>0</vehicleFlowRate>
								</vehicleFlow>
							</basicData>
						</measuredValue>
					</measuredValue>
					<measuredValue index="2">
						<measuredValue>
							<basicData xsi:type="TrafficFlow">
								<vehicleFlow>
									<vehicleFlowRate>240</vehicleFlowRate>
								</vehicleFlow>
							</basicData>
						</measuredValue>
					</measuredValue>
					<measuredValue index="3">
						<measuredValue>
							<basicData xsi:type="TrafficSpeed">
								<averageVehicleSpeed
									numberOfInputValuesUsed="0">
									<speed>77</speed>
								</averageVehicleSpeed>
							</basicData>
						</measuredValue>
					</measuredValue>
				</siteMeasurements>
			</payloadPublication>
		</d2LogicalModel>
	</SOAP:Body>
</SOAP:Envelope>
